Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_hal_lpuart.h
/** @defgroup LPUART_DriverEnable_Polarity      LPUART DriverEnable Polarity
  * @{
  */
#define LPUART_DE_POLARITY_HIGH               0x00000000U             /*!< Driver enable signal is active high */
#define LPUART_DE_POLARITY_LOW                LPUART_CR3_DEP          /*!< Driver enable signal is active low  */
/**
  * @}
  */

/** @defgroup LPUART_CR1_DEAT_ADDRESS_LSB_POS    LPUART Driver Enable Assertion Time LSB Position In CR1 Register
  * @{
  */
#define LPUART_CR1_DEAT_ADDRESS_LSB_POS       21U      /*!< LPUART Driver Enable assertion time LSB
                                                            position in CR1 register */
/**
  * @}
  */

/** @defgroup LPUART_CR1_DEDT_ADDRESS_LSB_POS    LPUART Driver Enable DeAssertion Time LSB Position In CR1 Register
  * @{
  */
#define LPUART_CR1_DEDT_ADDRESS_LSB_POS       16U      /*!< LPUART Driver Enable de-assertion time LSB
                                                            position in CR1 register */
/**
  * @}
  */

/** @defgroup LPUART_TimeOut_Value    LPUART polling-based communications time-out value
  * @{
  */
#define HAL_LPUART_TIMEOUT_VALUE              0x1FFFFFFU  /*!< LPUART polling-based communications time-out value */
/**
  * @}
  */

/** @defgroup LPUART_Flags     LPUART Status Flags
  *        Elements values convention: 0xXXXX
  *           - 0xXXXX  : Flag mask in the ISR register
  * @{
  */
#define LPUART_FLAG_TXFT                      LPUART_ISR_TXFT          /*!< LPUART TXFIFO threshold flag                */
#define LPUART_FLAG_RXFT                      LPUART_ISR_RXFT          /*!< LPUART RXFIFO threshold flag                */
#define LPUART_FLAG_RXFF                      LPUART_ISR_RXFF          /*!< LPUART RXFIFO Full flag                     */
#define LPUART_FLAG_TXFE                      LPUART_ISR_TXFE          /*!< LPUART TXFIFO Empty flag                    */
#define LPUART_FLAG_REACK                     LPUART_ISR_REACK         /*!< LPUART receive enable acknowledge flag      */
#define LPUART_FLAG_TEACK                     LPUART_ISR_TEACK         /*!< LPUART transmit enable acknowledge flag     */
#define LPUART_FLAG_WUF                       LPUART_ISR_WUF           /*!< LPUART wake-up from stop mode flag          */
#define LPUART_FLAG_RWU                       LPUART_ISR_RWU           /*!< LPUART receiver wake-up from mute mode flag */
#define LPUART_FLAG_SBKF                      LPUART_ISR_SBKF          /*!< LPUART send break flag                      */
#define LPUART_FLAG_CMF                       LPUART_ISR_CMF           /*!< LPUART character match flag                 */
#define LPUART_FLAG_BUSY                      LPUART_ISR_BUSY          /*!< LPUART busy flag                            */
#define LPUART_FLAG_CTS                       LPUART_ISR_CTS           /*!< LPUART clear to send flag                   */
#define LPUART_FLAG_CTSIF                     LPUART_ISR_CTSIF         /*!< LPUART clear to send interrupt flag         */
#define LPUART_FLAG_TXE                       LPUART_ISR_TXE           /*!< LPUART transmit data register empty         */
#define LPUART_FLAG_TC                        LPUART_ISR_TC            /*!< LPUART transmission complete                */
#define LPUART_FLAG_RXNE                      LPUART_ISR_RXNE          /*!< LPUART read data register not empty         */
#define LPUART_FLAG_IDLE                      LPUART_ISR_IDLE          /*!< LPUART idle flag                            */
#define LPUART_FLAG_ORE                       LPUART_ISR_ORE           /*!< LPUART overrun error                        */
#define LPUART_FLAG_NE                        LPUART_ISR_NE            /*!< LPUART noise error                          */
#define LPUART_FLAG_FE                        LPUART_ISR_FE            /*!< LPUART frame error                          */
#define LPUART_FLAG_PE                        LPUART_ISR_PE            /*!< LPUART parity error                         */
/**
  * @}
  */
/** @brief LPUART interruptions flag mask
  *
  * @{
  */
#define LPUART_IT_MASK                     0x0000001FU

#define LPUART_CR1_REG_INDEX               1U
#define LPUART_CR2_REG_INDEX               2U
#define LPUART_CR3_REG_INDEX               3U
/**
  * @}
  */

/** @defgroup LPUART_Interrupt_definition LPUART Interrupts Definition
  *        Elements values convention: 000ZZZZZ0XXYYYYYb
  *           - YYYYY  : Interrupt source position in the XX register (5bits)
  *           - XX  : Interrupt source register (2bits)
  *                 - 01: CR1 register
  *                 - 10: CR2 register
  *                 - 11: CR3 register
  *           - ZZZZZ  : Flag position in the ISR register(5bits)
  *        Elements values convention: 000000000XXYYYYYb
  *           - YYYYY  : Interrupt source position in the XX register (5bits)
  *           - XX  : Interrupt source register (2bits)
  *                 - 01: CR1 register
  *                 - 10: CR2 register
  *                 - 11: CR3 register
  *        Elements values convention: 0000ZZZZ00000000b
  *           - ZZZZ  : Flag position in the ISR register(4bits)
  * @{
  */
#define LPUART_IT_RXFF                        0x183FU        /*!< LPUART RXFIFO full interruption                  */
#define LPUART_IT_TXFE                        0x173EU        /*!< LPUART TXFIFO empty interruption                 */
#define LPUART_IT_IDLE                        0x0424U        /*!< LPUART idle interruption                         */
#define LPUART_IT_PE                          0x0028U        /*!< LPUART parity error interruption                 */
#define LPUART_IT_RXNE                        0x0525U        /*!< LPUART read data register not empty interruption */
#define LPUART_IT_TC                          0x0626U        /*!< LPUART transmission complete interruption        */
#define LPUART_IT_TXE                         0x0727U        /*!< LPUART transmit data register empty interruption */
#define LPUART_IT_CM                          0x112EU        /*!< LPUART Character Matching Interrupt interruption */
#define LPUART_IT_RXFT                        0x1A7CU        /*!< LPUART RXFIFO threshold reached interruption     */
#define LPUART_IT_TXFT                        0x1B77U        /*!< LPUART TXFIFO threshold reached interruption     */
#define LPUART_IT_WUF                         0x1476U        /*!< LPUART WUF interruption                         */
#define LPUART_IT_CTS                         0x096AU        /*!< LPUART fCTS interruption                         */
#define LPUART_IT_ERR                         0x0060U        /*!< LPUART error interruption                        */

#define LPUART_IT_ORE                         0x0300U        /*!< LPUART overrun error interruption                */
#define LPUART_IT_NE                          0x0200U        /*!< LPUART noise error interruption                  */
#define LPUART_IT_FE                          0x0100U        /*!< LPUART frame error interruption                  */

/**
  * @}
  */

/** @defgroup LPUART_IT_CLEAR_Flags  LPUART Interruption Clear Flags
  * @{
  */
#define LPUART_CLEAR_PEF                       LPUART_ICR_PECF            /*!< Parity Error Clear Flag           */
#define LPUART_CLEAR_FEF                       LPUART_ICR_FECF            /*!< Framing Error Clear Flag          */
#define LPUART_CLEAR_NEF                       LPUART_ICR_NECF            /*!< Noise Error detected Clear Flag   */
#define LPUART_CLEAR_OREF                      LPUART_ICR_ORECF           /*!< Overrun Error Clear Flag          */
#define LPUART_CLEAR_IDLEF                     LPUART_ICR_IDLECF          /*!< IDLE line detected Clear Flag     */
#define LPUART_CLEAR_TCF                       LPUART_ICR_TCCF            /*!< Transmission Complete Clear Flag  */
#define LPUART_CLEAR_CTSF                      LPUART_ICR_CTSCF           /*!< CTS Interrupt Clear Flag          */
#define LPUART_CLEAR_CMF                       LPUART_ICR_CMCF            /*!< Character Match Clear Flag        */
#define LPUART_CLEAR_WUF                       LPUART_ICR_WUCF            /*!< Wake Up from stop mode Clear Flag */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macros -----------------------------------------------------------*/
/** @defgroup LPUART_Exported_Macros LPUART Exported Macros
  * @{
  */

/** @brief  Reset LPUART handle states.
  * @param  __HANDLE__ LPUART handle.
  * @retval None
  */
#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
#define __HAL_LPUART_RESET_HANDLE_STATE(__HANDLE__)  do{                                                   \
                                                         (__HANDLE__)->gState = HAL_LPUART_STATE_RESET;      \
                                                         (__HANDLE__)->RxState = HAL_LPUART_STATE_RESET;     \
                                                         (__HANDLE__)->MspInitCallback = NULL;             \
                                                         (__HANDLE__)->MspDeInitCallback = NULL;           \
                                                       } while(0U)
#else
#define __HAL_LPUART_RESET_HANDLE_STATE(__HANDLE__)  do{                                                   \
                                                         (__HANDLE__)->gState = HAL_LPUART_STATE_RESET;      \
                                                         (__HANDLE__)->RxState = HAL_LPUART_STATE_RESET;     \
                                                       } while(0U)
#endif /*USE_HAL_LPUART_REGISTER_CALLBACKS */

/** @brief  Flush the LPUART Data registers.
  * @param  __HANDLE__ specifies the LPUART Handle.
  * @retval None
  */
#define __HAL_LPUART_FLUSH_DRREGISTER(__HANDLE__)  \
  do{                \
    SET_BIT((__HANDLE__)->Instance->RQR, LPUART_RXDATA_FLUSH_REQUEST); \
    SET_BIT((__HANDLE__)->Instance->RQR, LPUART_TXDATA_FLUSH_REQUEST); \
  }  while(0U)

/** @brief  Clear the specified LPUART pending flag.
  * @param  __HANDLE__ specifies the LPUART Handle.
  * @param  __FLAG__ specifies the flag to check.
  *          This parameter can be any combination of the following values:
  *            @arg @ref LPUART_CLEAR_PEF      Parity Error Clear Flag
  *            @arg @ref LPUART_CLEAR_FEF      Framing Error Clear Flag
  *            @arg @ref LPUART_CLEAR_NEF      Noise detected Clear Flag
  *            @arg @ref LPUART_CLEAR_OREF     Overrun Error Clear Flag
  *            @arg @ref LPUART_CLEAR_IDLEF    IDLE line detected Clear Flag
  *            @arg @ref LPUART_CLEAR_TCF      Transmission Complete Clear Flag
  *            @arg @ref LPUART_CLEAR_CTSF     CTS Interrupt Clear Flag
  *            @arg @ref LPUART_CLEAR_CMF      Character Match Clear Flag
  *            @arg @ref LPUART_CLEAR_WUF      Wake Up from stop mode Clear Flag
  * @retval None
  */
#define __HAL_LPUART_CLEAR_FLAG(__HANDLE__, __FLAG__) ((__HANDLE__)->Instance->ICR = (__FLAG__))

/** @brief  Clear the LPUART PE pending flag.
  * @param  __HANDLE__ specifies the LPUART Handle.
  * @retval None
  */
#define __HAL_LPUART_CLEAR_PEFLAG(__HANDLE__)   __HAL_LPUART_CLEAR_FLAG((__HANDLE__), LPUART_CLEAR_PEF)

/** @brief  Clear the LPUART FE pending flag.
  * @param  __HANDLE__ specifies the LPUART Handle.
  * @retval None
  */
#define __HAL_LPUART_CLEAR_FEFLAG(__HANDLE__)   __HAL_LPUART_CLEAR_FLAG((__HANDLE__), LPUART_CLEAR_FEF)

/** @brief  Clear the LPUART NE pending flag.
  * @param  __HANDLE__ specifies the LPUART Handle.
  * @retval None
  */
#define __HAL_LPUART_CLEAR_NEFLAG(__HANDLE__)  __HAL_LPUART_CLEAR_FLAG((__HANDLE__), LPUART_CLEAR_NEF)

/** @brief  Clear the LPUART ORE pending flag.
  * @param  __HANDLE__ specifies the LPUART Handle.
  * @retval None
  */
#define __HAL_LPUART_CLEAR_OREFLAG(__HANDLE__)   __HAL_LPUART_CLEAR_FLAG((__HANDLE__), LPUART_CLEAR_OREF)

/** @brief  Clear the LPUART IDLE pending flag.
  * @param  __HANDLE__ specifies the LPUART Handle.
  * @retval None
  */
#define __HAL_LPUART_CLEAR_IDLEFLAG(__HANDLE__)   __HAL_LPUART_CLEAR_FLAG((__HANDLE__), LPUART_CLEAR_IDLEF)

/** @brief  Check whether the specified LPUART flag is set or not.
  * @param  __HANDLE__ specifies the LPUART Handle.
  * @param  __FLAG__ specifies the flag to check.
  *        This parameter can be one of the following values:
  *            @arg @ref LPUART_FLAG_TXFT  TXFIFO threshold flag
  *            @arg @ref LPUART_FLAG_RXFT  RXFIFO threshold flag
  *            @arg @ref LPUART_FLAG_RXFF  RXFIFO Full flag
  *            @arg @ref LPUART_FLAG_TXFE  TXFIFO Empty flag
  *            @arg @ref LPUART_FLAG_REACK Receive enable acknowledge flag
  *            @arg @ref LPUART_FLAG_TEACK Transmit enable acknowledge flag
  *            @arg @ref LPUART_FLAG_WUF   Wake up from stop mode flag
  *            @arg @ref LPUART_FLAG_RWU   Receiver wake up flag (if the LPUART in mute mode)
  *            @arg @ref LPUART_FLAG_SBKF  Send Break flag
  *            @arg @ref LPUART_FLAG_CMF   Character match flag
  *            @arg @ref LPUART_FLAG_BUSY  Busy flag
  *            @arg @ref LPUART_FLAG_CTS   CTS Change flag
  *            @arg @ref LPUART_FLAG_TXE   Transmit data register empty flag
  *            @arg @ref LPUART_FLAG_TC    Transmission Complete flag
  *            @arg @ref LPUART_FLAG_RXNE  Receive data register not empty flag
  *            @arg @ref LPUART_FLAG_IDLE  Idle Line detection flag
  *            @arg @ref LPUART_FLAG_ORE   Overrun Error flag
  *            @arg @ref LPUART_FLAG_NE    Noise Error flag
  *            @arg @ref LPUART_FLAG_FE    Framing Error flag
  *            @arg @ref LPUART_FLAG_PE    Parity Error flag
  * @retval The new state of __FLAG__ (TRUE or FALSE).
  */
#define __HAL_LPUART_GET_FLAG(__HANDLE__, __FLAG__) (((__HANDLE__)->Instance->ISR & (__FLAG__)) == (__FLAG__))

